// 1.Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы
// назвали такую переменную?

// const planetName = "Земля";
// let visitorName;



// 2.Создайте страницу, которая спрашивает имя у пользователя и выводит его.

// userName = prompt("Как вас зовут?");
// alert("Привет, " + userName);



// 3.Запросить у пользователя число. Затем запросить степень, в которую нужно
// возвести это число. Вывести в консоль результат.

// let number = prompt("Введите число:");
// let exponent = prompt("Введите степень:");

// let result = Math.pow(number, exponent);
// console.log(result);